In [1]:
import sqlite3
from pathlib import Path

In [2]:
import psycopg2
import pandas as pd
#magic function that enables us to establish a connection to the PostgreSQL database.
%load_ext sql

In [3]:
DB_USER = "postgres"      # Replace with your username
DB_PASSWORD = "6210"  # Replace with your password
DB_HOST = "localhost"       # 'localhost' if your database is on your local machine
DB_NAME = "covid_project"      # Replace with your database name

conn_string = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME}"

In [4]:
%sql $conn_string

In [5]:
# Load the CSV file
df = pd.read_csv(r"D:\GITHUB\SQL\Supermarket sales\supermarket_sales - Sheet1.csv")

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 17 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Invoice ID               1000 non-null   object
 1   Branch                   1000 non-null   object
 2   City                     1000 non-null   object
 3   Customer type            1000 non-null   object
 4   Gender                   1000 non-null   object
 5   Product line             1000 non-null   object
 6   Unit price               1000 non-null   float64
 7   Quantity                 1000 non-null   int64
 8   Tax 5%                   1000 non-null   float64
 9   Total                    1000 non-null   float64
 10  Date                     1000 non-null   object
 11  Time                     1000 non-null   object
 12  Payment                  1000 non-null   object
 13  cogs                     1000 non-null   float64
 14  gross margin percentage  1000 non-null   float64
 15  gross income             1000 non-null   float64
 16  Rating                   1000 non-null   float64
dtypes: float64(7), int64(1), object(9)
memory usage: 132.9+ KB
None

In [7]:
#table creation
df.to_sql("supermarket_sales", conn_string, if_exists="append", index=False)

1000

In [8]:
%sql select * from supermarket_sales LIMIT 5;

 * postgresql://postgres:***@localhost/covid_project
5 rows affected.

[('750-67-8428', 'A', 'Yangon', 'Member', 'Female', 'Health and beauty', 74.69, 7, 26.1415, 548.9715, datetime.date(2019, 1, 5), datetime.time(13, 8), 'Ewallet', 522.83, 4.761904762, 26.1415, 9.1),
 ('226-31-3081', 'C', 'Naypyitaw', 'Normal', 'Female', 'Electronic accessories', 15.28, 5, 3.82, 80.22, datetime.date(2019, 3, 8), datetime.time(10, 29), 'Cash', 76.4, 4.761904762, 3.82, 9.6),
 ('631-41-3108', 'A', 'Yangon', 'Normal', 'Male', 'Home and lifestyle', 46.33, 7, 16.2155, 340.5255, datetime.date(2019, 3, 3), datetime.time(13, 23), 'Credit card', 324.31, 4.761904762, 16.2155, 7.4),
 ('123-19-1176', 'A', 'Yangon', 'Member', 'Male', 'Health and beauty', 58.22, 8, 23.288, 489.048, datetime.date(2019, 1, 27), datetime.time(20, 33), 'Ewallet', 465.76, 4.761904762, 23.288, 8.4),
 ('373-73-7910', 'A', 'Yangon', 'Normal', 'Male', 'Sports and travel', 86.31, 7, 30.2085, 634.3785, datetime.date(2019, 2, 8), datetime.time(10, 37), 'Ewallet', 604.17, 4.761904762, 30.2085, 5.3)]

In [10]:
%%sql

SELECT 
    column_name, 
    data_type 
FROM 
    information_schema.columns 
WHERE 
    table_name = 'supermarket_sales';

 * postgresql://postgres:***@localhost/covid_project
17 rows affected.

[('Rating', 'double precision'),
 ('Unit price', 'double precision'),
 ('Quantity', 'bigint'),
 ('Tax 5%', 'double precision'),
 ('Total', 'double precision'),
 ('cogs', 'double precision'),
 ('gross margin percentage', 'double precision'),
 ('gross income', 'double precision'),
 ('Payment', 'text'),
 ('Invoice ID', 'text'),
 ('Branch', 'text'),
 ('City', 'text'),
 ('Customer type', 'text'),
 ('Gender', 'text'),
 ('Product line', 'text'),
 ('Date', 'text'),
 ('Time', 'text')]

In [15]:
# changing datatypes of columns

%%sql
ALTER TABLE supermarket_sales
ALTER COLUMN "Quantity" TYPE integer,
ALTER COLUMN "Date" TYPE date USING "Date"::date,
ALTER COLUMN "Time" TYPE time USING "Time"::time;

 * postgresql://postgres:***@localhost/covid_project
Done.

[]

In [19]:
%sql SELECT * FROM supermarket_sales LIMIT 10;

 * postgresql://postgres:***@localhost/covid_project
10 rows affected.

[('750-67-8428', 'A', 'Yangon', 'Member', 'Female', 'Health and beauty', 74.69, 7, 26.1415, 548.9715, datetime.date(2019, 1, 5), datetime.time(13, 8), 'Ewallet', 522.83, 4.761904762, 26.1415, 9.1),
 ('226-31-3081', 'C', 'Naypyitaw', 'Normal', 'Female', 'Electronic accessories', 15.28, 5, 3.82, 80.22, datetime.date(2019, 3, 8), datetime.time(10, 29), 'Cash', 76.4, 4.761904762, 3.82, 9.6),
 ('631-41-3108', 'A', 'Yangon', 'Normal', 'Male', 'Home and lifestyle', 46.33, 7, 16.2155, 340.5255, datetime.date(2019, 3, 3), datetime.time(13, 23), 'Credit card', 324.31, 4.761904762, 16.2155, 7.4),
 ('123-19-1176', 'A', 'Yangon', 'Member', 'Male', 'Health and beauty', 58.22, 8, 23.288, 489.048, datetime.date(2019, 1, 27), datetime.time(20, 33), 'Ewallet', 465.76, 4.761904762, 23.288, 8.4),
 ('373-73-7910', 'A', 'Yangon', 'Normal', 'Male', 'Sports and travel', 86.31, 7, 30.2085, 634.3785, datetime.date(2019, 2, 8), datetime.time(10, 37), 'Ewallet', 604.17, 4.761904762, 30.2085, 5.3),
 ('699-14-3026', 'C', 'Naypyitaw', 'Normal', 'Male', 'Electronic accessories', 85.39, 7, 29.8865, 627.6165, datetime.date(2019, 3, 25), datetime.time(18, 30), 'Ewallet', 597.73, 4.761904762, 29.8865, 4.1),
 ('355-53-5943', 'A', 'Yangon', 'Member', 'Female', 'Electronic accessories', 68.84, 6, 20.652, 433.692, datetime.date(2019, 2, 25), datetime.time(14, 36), 'Ewallet', 413.04, 4.761904762, 20.652, 5.8),
 ('315-22-5665', 'C', 'Naypyitaw', 'Normal', 'Female', 'Home and lifestyle', 73.56, 10, 36.78, 772.38, datetime.date(2019, 2, 24), datetime.time(11, 38), 'Ewallet', 735.6, 4.761904762, 36.78, 8.0),
 ('665-32-9167', 'A', 'Yangon', 'Member', 'Female', 'Health and beauty', 36.26, 2, 3.626, 76.146, datetime.date(2019, 1, 10), datetime.time(17, 15), 'Credit card', 72.52, 4.761904762, 3.626, 7.2),
 ('692-92-5582', 'B', 'Mandalay', 'Member', 'Female', 'Food and beverages', 54.84, 3, 8.226, 172.746, datetime.date(2019, 2, 20), datetime.time(13, 27), 'Credit card', 164.52, 4.761904762, 8.226, 5.9)]

In [29]:
# renaming columns for better query practice
%%sql

ALTER TABLE supermarket_sales RENAME COLUMN "Unit price" TO Unit_price;
ALTER TABLE supermarket_sales RENAME COLUMN "gross income" TO Gross_income;
ALTER TABLE supermarket_sales RENAME COLUMN "Tax 5%" TO Tax_5_percent;
ALTER TABLE supermarket_sales RENAME COLUMN "gross margin percentage" TO gross_margin_percentage;
ALTER TABLE supermarket_sales RENAME COLUMN "Invoice ID" TO Invoice_ID;
ALTER TABLE supermarket_sales RENAME COLUMN "Customer type" TO Customer_type;
ALTER TABLE supermarket_sales RENAME COLUMN "Product line" TO Product_line;

 * postgresql://postgres:***@localhost/covid_project
Done.
Done.
Done.

[]

In [43]:
%%sql

ALTER TABLE supermarket_sales RENAME COLUMN "Branch" TO branch;
ALTER TABLE supermarket_sales RENAME COLUMN "City" TO city;
ALTER TABLE supermarket_sales RENAME COLUMN "Gender" TO gender;
ALTER TABLE supermarket_sales RENAME COLUMN "Quantity" TO quantity;
ALTER TABLE supermarket_sales RENAME COLUMN "Total" TO total;
ALTER TABLE supermarket_sales RENAME COLUMN "Date" TO date;
ALTER TABLE supermarket_sales RENAME COLUMN "Time" TO time;
ALTER TABLE supermarket_sales RENAME COLUMN "Payment" TO payment;
ALTER TABLE supermarket_sales RENAME COLUMN "Rating" TO rating;

 * postgresql://postgres:***@localhost/covid_project
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# <span style='color:blue; font-family:Helvetica'>***Sales Analysis***</span>

In [6]:
# Total Sales
%sql select ROUND(CAST(SUM(Total) AS numeric), 2) as Total_Sales from supermarket_sales;

 * postgresql://postgres:***@localhost/covid_project
1 rows affected.

[(Decimal('322966.75'),)]

In [7]:
# Average Sales
%sql select ROUND(CAST(AVG(Total) AS numeric), 2) as Average_Sales from supermarket_sales;

 * postgresql://postgres:***@localhost/covid_project
1 rows affected.

[(Decimal('322.97'),)]

In [10]:
# What are the total sales per product line?

%sql SELECT product_line , ROUND(CAST(SUM(Total) AS numeric), 2) as Total_sales_per_product_line FROM supermarket_sales group by product_line;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Fashion accessories', Decimal('54305.90')),
 ('Electronic accessories', Decimal('54337.53')),
 ('Health and beauty', Decimal('49193.74')),
 ('Food and beverages', Decimal('56144.84')),
 ('Sports and travel', Decimal('55122.83')),
 ('Home and lifestyle', Decimal('53861.91'))]

#### Average quantity sold per product line

In [14]:
%sql select product_line,sum(quantity) as quantity_sold from supermarket_sales Group By product_line;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Fashion accessories', 902),
 ('Electronic accessories', 971),
 ('Health and beauty', 854),
 ('Food and beverages', 952),
 ('Sports and travel', 920),
 ('Home and lifestyle', 911)]

In [27]:
# comment
%sql SELECT product_line,city, ROUND(CAST(SUM(Total) AS numeric), 2) as total_sales_per_city,SUM(quantity) as quantity_sold,AVG(unit_price) as average_price,MAX(Total) as highest_sale FROM supermarket_sales GROUP BY product_line, city ORDER BY product_line, city;

 * postgresql://postgres:***@localhost/covid_project
18 rows affected.

[('Electronic accessories', 'Mandalay', Decimal('17051.44'), 316, 49.85418181818182, 942.4485),
 ('Electronic accessories', 'Naypyitaw', Decimal('18968.97'), 333, 55.80945454545453, 864.57),
 ('Electronic accessories', 'Yangon', Decimal('18317.11'), 322, 54.871166666666674, 931.035),
 ('Fashion accessories', 'Mandalay', Decimal('16413.32'), 297, 54.84387096774193, 874.125),
 ('Fashion accessories', 'Naypyitaw', Decimal('21560.07'), 342, 59.735999999999976, 1042.65),
 ('Fashion accessories', 'Yangon', Decimal('16332.51'), 263, 56.670392156862775, 1039.29),
 ('Food and beverages', 'Mandalay', Decimal('15214.89'), 270, 55.54, 888.615),
 ('Food and beverages', 'Naypyitaw', Decimal('23766.86'), 369, 57.27303030303028, 1034.46),
 ('Food and beverages', 'Yangon', Decimal('17163.10'), 313, 54.974482758620695, 932.337),
 ('Health and beauty', 'Mandalay', Decimal('19980.66'), 320, 58.18566037735849, 922.635),
 ('Health and beauty', 'Naypyitaw', Decimal('16615.33'), 277, 55.971346153846156, 950.25),
 ('Health and beauty', 'Yangon', Decimal('12597.75'), 257, 49.862340425531926, 752.64),
 ('Home and lifestyle', 'Mandalay', Decimal('17549.16'), 295, 55.514, 1022.49),
 ('Home and lifestyle', 'Naypyitaw', Decimal('13895.55'), 245, 54.33422222222223, 1023.75),
 ('Home and lifestyle', 'Yangon', Decimal('22417.20'), 371, 55.84569230769231, 951.825),
 ('Sports and travel', 'Mandalay', Decimal('19988.20'), 322, 59.67806451612902, 944.622),
 ('Sports and travel', 'Naypyitaw', Decimal('15761.93'), 265, 55.10733333333332, 1002.12),
 ('Sports and travel', 'Yangon', Decimal('19372.70'), 333, 55.61033898305084, 926.9505)]

# <span style='color:blue; font-family:Helvetica'>***Customer Analysis***</span>

- **Total Sales by Gender**
- **Average Sale Amount per Transaction by Gender**
- **Number of Transactions by Gender**

In [9]:
%%sql
select gender,sum(total) as Total_sales , AVG(unit_price) AS Average_Sale, COUNT(*) AS Transactions from supermarket_sales 
Group By gender;

 * postgresql://postgres:***@localhost/covid_project
2 rows affected.

[('Female', 167882.92500000002, 55.26395209580837, 501),
 ('Male', 155083.82400000014, 56.081943887775566, 499)]

#### Sales by Customer Type and Gender

In [103]:
%%sql

select Customer_type,gender,sum(unit_price) as total from supermarket_sales 
Group By Customer_type,gender;

 * postgresql://postgres:***@localhost/covid_project
4 rows affected.

[('Member', 'Female', 14558.139999999998),
 ('Normal', 'Male', 14383.330000000004),
 ('Normal', 'Female', 13129.099999999995),
 ('Member', 'Male', 13601.56)]

#### Count of Transactions by Membership, total sales for members and non-members and average sale amount per transaction for both groups

In [107]:
%%sql 
SELECT Customer_type, COUNT(*), sum(Unit_price), avg(Unit_price) FROM supermarket_sales  
GROUP BY Customer_type;

 * postgresql://postgres:***@localhost/covid_project
2 rows affected.

[('Normal', 499, 27512.429999999997, 55.13513026052104),
 ('Member', 501, 28159.7, 56.20698602794411)]

#### the quantity of items purchased by members vs. non-members.

In [108]:
%sql SELECT Customer_type, AVG(quantity) FROM supermarket_sales GROUP BY Customer_type;

 * postgresql://postgres:***@localhost/covid_project
2 rows affected.

[('Normal', Decimal('5.4609218436873747')),
 ('Member', Decimal('5.5588822355289421'))]

#### Average rating by customer type and gender

In [114]:
%%sql 

select Customer_type, gender, AVG(rating) FROM supermarket_sales 
GROUP BY Customer_type,gender;

 * postgresql://postgres:***@localhost/covid_project
4 rows affected.

[('Member', 'Female', 6.940613026819924),
 ('Normal', 'Male', 7.018918918918916),
 ('Normal', 'Female', 6.990416666666664),
 ('Member', 'Male', 6.939999999999998)]

In [36]:
# which Customer type constitutes to highest revenue
%sql select Customer_type, ROUND(CAST(SUM(Total) AS numeric), 2) from supermarket_sales GROUP BY Customer_type;

 * postgresql://postgres:***@localhost/covid_project
2 rows affected.

[('Normal', Decimal('158743.31')), ('Member', Decimal('164223.44'))]

# <span style='color:blue; font-family:Helvetica'>***Product Analysis***</span>

In [38]:
# which Product line constitutes to highest revenue
%sql select Product_line, ROUND(CAST(SUM(Total) AS numeric), 2) as Revenue from supermarket_sales GROUP BY Product_line order by Revenue DESC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Food and beverages', Decimal('56144.84')),
 ('Sports and travel', Decimal('55122.83')),
 ('Electronic accessories', Decimal('54337.53')),
 ('Fashion accessories', Decimal('54305.90')),
 ('Home and lifestyle', Decimal('53861.91')),
 ('Health and beauty', Decimal('49193.74'))]

#### Average Rating by Product Line

In [51]:
%%sql

select Product_line, ROUND(CAST(Avg(rating) AS numeric), 2) as Avg_Rating from supermarket_sales 
GROUP BY Product_line
order by Avg_Rating DESC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Food and beverages', Decimal('7.11')),
 ('Fashion accessories', Decimal('7.03')),
 ('Health and beauty', Decimal('7.00')),
 ('Electronic accessories', Decimal('6.92')),
 ('Sports and travel', Decimal('6.92')),
 ('Home and lifestyle', Decimal('6.84'))]

# <span style='color:blue; font-family:Helvetica'>***Temporal Analysis***</span>

In [ ]:
#Sales trends over time (monthly).
#Time of day analysis (which time slots see the most sales).

In [119]:
%%sql

SELECT EXTRACT(YEAR FROM Date) AS Year, 
       EXTRACT(MONTH FROM Date) AS Month, 
       SUM(Total) 
FROM supermarket_sales 
GROUP BY EXTRACT(YEAR FROM Date), EXTRACT(MONTH FROM Date)
ORDER BY Year, Month;

 * postgresql://postgres:***@localhost/covid_project
3 rows affected.

[(Decimal('2019'), Decimal('1'), 116291.86800000005),
 (Decimal('2019'), Decimal('2'), 97219.37399999997),
 (Decimal('2019'), Decimal('3'), 109455.50700000004)]

##### Which day has the highest total sales?

In [47]:
%%sql 

SELECT CASE EXTRACT(DOW FROM Date)
WHEN 0 THEN 'Sunday'
WHEN 1 THEN 'Monday'
WHEN 2 THEN 'Tuesday'
WHEN 3 THEN 'Wednesday'
WHEN 4 THEN 'Thursday'
WHEN 5 THEN 'Friday'
WHEN 6 THEN 'Saturday'
END AS day_of_week_name,
ROUND(CAST(SUM(Total) AS numeric), 2) as Total 
FROM supermarket_sales 
GROUP BY EXTRACT(DOW FROM Date) 
ORDER BY EXTRACT(DOW FROM Date);

 * postgresql://postgres:***@localhost/covid_project
7 rows affected.

[('Sunday', Decimal('44457.89')),
 ('Monday', Decimal('37899.08')),
 ('Tuesday', Decimal('51482.25')),
 ('Wednesday', Decimal('43731.14')),
 ('Thursday', Decimal('45349.25')),
 ('Friday', Decimal('43926.34')),
 ('Saturday', Decimal('56120.81'))]

In [133]:
%%sql

SELECT EXTRACT(HOUR FROM Time::time) as Hour, ROUND(CAST(SUM(Total) AS numeric), 2) as Total FROM supermarket_sales
GROUP BY EXTRACT(HOUR FROM Time::time)
order by Total DESC;

 * postgresql://postgres:***@localhost/covid_project
11 rows affected.

[(Decimal('19'), Decimal('39699.51')),
 (Decimal('13'), Decimal('34723.23')),
 (Decimal('10'), Decimal('31421.48')),
 (Decimal('15'), Decimal('31179.51')),
 (Decimal('14'), Decimal('30828.40')),
 (Decimal('11'), Decimal('30377.33')),
 (Decimal('12'), Decimal('26065.88')),
 (Decimal('18'), Decimal('26030.34')),
 (Decimal('16'), Decimal('25226.32')),
 (Decimal('17'), Decimal('24445.22')),
 (Decimal('20'), Decimal('22969.53'))]

# <span style='color:blue; font-family:Helvetica'>***Payment Method Analysis***</span>

#### Proportion of sales per payment method (Ewallet, Cash, Credit card)

In [134]:
%%sql

select payment, ROUND(CAST(SUM(Total) AS numeric), 2) as total from supermarket_sales 
group by payment;

 * postgresql://postgres:***@localhost/covid_project
3 rows affected.

[('Credit card', Decimal('100767.07')),
 ('Ewallet', Decimal('109993.11')),
 ('Cash', Decimal('112206.57'))]

In [32]:
# which payment mode is most preferred by users

%sql select payment, sum(quantity)as No_of_transactions from supermarket_sales group by payment order by No_of_transactions DESC;

 * postgresql://postgres:***@localhost/covid_project
3 rows affected.

[('Cash', 1896), ('Ewallet', 1892), ('Credit card', 1722)]

# <span style='color:blue; font-family:Helvetica'>***Profitability Analysis***</span>

In [52]:
#Gross income per product line

%sql select Product_line, ROUND(CAST(SUM(gross_income) AS numeric), 2) as gross_income from supermarket_sales GROUP BY Product_line order by gross_income DESC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Food and beverages', Decimal('2673.56')),
 ('Sports and travel', Decimal('2624.90')),
 ('Electronic accessories', Decimal('2587.50')),
 ('Fashion accessories', Decimal('2586.00')),
 ('Home and lifestyle', Decimal('2564.85')),
 ('Health and beauty', Decimal('2342.56'))]

In [61]:
%%sql

SELECT Product_line,
ROUND(CAST(SUM(Total) AS numeric), 2) AS total_sales,
ROUND(CAST(SUM(cogs) AS numeric), 2) AS total_cogs,
ROUND(CAST(SUM(Total - cogs) AS numeric), 2) AS total_gross_margin
FROM supermarket_sales
GROUP BY Product_line
ORDER BY total_gross_margin DESC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Food and beverages', Decimal('56144.84'), Decimal('53471.28'), Decimal('2673.56')),
 ('Sports and travel', Decimal('55122.83'), Decimal('52497.93'), Decimal('2624.90')),
 ('Electronic accessories', Decimal('54337.53'), Decimal('51750.03'), Decimal('2587.50')),
 ('Fashion accessories', Decimal('54305.90'), Decimal('51719.90'), Decimal('2586.00')),
 ('Home and lifestyle', Decimal('53861.91'), Decimal('51297.06'), Decimal('2564.85')),
 ('Health and beauty', Decimal('49193.74'), Decimal('46851.18'), Decimal('2342.56'))]

In [65]:
%%sql

SELECT Customer_type,
ROUND(CAST(SUM(Total) AS numeric), 2) AS total_sales,
ROUND(CAST(SUM(cogs) AS numeric), 2) AS total_cogs,
ROUND(CAST(SUM(Total - cogs) AS numeric), 2) AS total_gross_margin
FROM supermarket_sales
GROUP BY Customer_type
ORDER BY total_gross_margin DESC;

 * postgresql://postgres:***@localhost/covid_project
2 rows affected.

[('Member', Decimal('164223.44'), Decimal('156403.28'), Decimal('7820.16')),
 ('Normal', Decimal('158743.31'), Decimal('151184.10'), Decimal('7559.21'))]

# <span style='color:blue; font-family:Helvetica'>***Correlation Analysis***</span>

Correlation between rating and sales

In [66]:
%%sql

SELECT AVG(Rating) AS Average_Rating, SUM(Total) AS Total_Sales FROM 
supermarket_sales GROUP BY Product_line;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[(7.029213483146067, 54305.895),
 (6.92470588235294, 54337.531500000005),
 (7.003289473684212, 49193.739000000016),
 (7.113218390804598, 56144.844000000005),
 (6.916265060240964, 55122.826499999996),
 (6.8375, 53861.91300000001)]

Correlation between quantity sold and gross income.

In [72]:
%%sql

SELECT Branch, Customer_type, COUNT(*) FROM supermarket_sales  
GROUP BY Branch, Customer_type
order by Branch,Customer_type;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('A', 'Member', 167),
 ('A', 'Normal', 173),
 ('B', 'Member', 165),
 ('B', 'Normal', 167),
 ('C', 'Member', 169),
 ('C', 'Normal', 159)]

# <span style='color:blue; font-family:Helvetica'>***Geographical Analysis***</span>

Comparison of sales performance across different cities or branches.
Product line popularity by city.

In [73]:
# Which branch sold the most products?
%sql SELECT branch, ROUND(CAST(SUM(Total) AS numeric), 2) as Total_sales_per_Branch FROM supermarket_sales GROUP BY branch;

 * postgresql://postgres:***@localhost/covid_project
3 rows affected.

[('A', Decimal('106200.37')),
 ('B', Decimal('106197.67')),
 ('C', Decimal('110568.71'))]

In [74]:
%sql SELECT city, ROUND(CAST(SUM(Total) AS numeric), 2) as total_sales_per_city FROM supermarket_sales GROUP BY city;

 * postgresql://postgres:***@localhost/covid_project
3 rows affected.

[('Yangon', Decimal('106200.37')),
 ('Naypyitaw', Decimal('110568.71')),
 ('Mandalay', Decimal('106197.67'))]

In [76]:
%%sql 
SELECT city,Product_line, ROUND(CAST(SUM(Total) AS numeric), 2) as total_sales_per_city FROM supermarket_sales 
GROUP BY city,Product_line 
order by city,Product_line DESC;

 * postgresql://postgres:***@localhost/covid_project
18 rows affected.

[('Mandalay', 'Sports and travel', Decimal('19988.20')),
 ('Mandalay', 'Home and lifestyle', Decimal('17549.16')),
 ('Mandalay', 'Health and beauty', Decimal('19980.66')),
 ('Mandalay', 'Food and beverages', Decimal('15214.89')),
 ('Mandalay', 'Fashion accessories', Decimal('16413.32')),
 ('Mandalay', 'Electronic accessories', Decimal('17051.44')),
 ('Naypyitaw', 'Sports and travel', Decimal('15761.93')),
 ('Naypyitaw', 'Home and lifestyle', Decimal('13895.55')),
 ('Naypyitaw', 'Health and beauty', Decimal('16615.33')),
 ('Naypyitaw', 'Food and beverages', Decimal('23766.86')),
 ('Naypyitaw', 'Fashion accessories', Decimal('21560.07')),
 ('Naypyitaw', 'Electronic accessories', Decimal('18968.97')),
 ('Yangon', 'Sports and travel', Decimal('19372.70')),
 ('Yangon', 'Home and lifestyle', Decimal('22417.20')),
 ('Yangon', 'Health and beauty', Decimal('12597.75')),
 ('Yangon', 'Food and beverages', Decimal('17163.10')),
 ('Yangon', 'Fashion accessories', Decimal('16332.51')),
 ('Yangon', 'Electronic accessories', Decimal('18317.11'))]

# <span style='color:blue; font-family:Helvetica'>***Inventory Analysis***</span>

Fast-moving and slow-moving products.
Product line stock requirements based on sales data.

In [80]:
%%sql

SELECT Product_line, SUM(quantity) as TotalQuantity
FROM supermarket_sales
GROUP BY Product_line
ORDER BY TotalQuantity DESC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Electronic accessories', 971),
 ('Food and beverages', 952),
 ('Sports and travel', 920),
 ('Home and lifestyle', 911),
 ('Fashion accessories', 902),
 ('Health and beauty', 854)]

In [81]:
%%sql

SELECT Product_line, SUM(quantity) as TotalQuantity
FROM supermarket_sales
GROUP BY Product_line
ORDER BY TotalQuantity ASC;

 * postgresql://postgres:***@localhost/covid_project
6 rows affected.

[('Health and beauty', 854),
 ('Fashion accessories', 902),
 ('Home and lifestyle', 911),
 ('Sports and travel', 920),
 ('Food and beverages', 952),
 ('Electronic accessories', 971)]